<template>
	<view style="padding: 10px;">
		<view>选题名：交通安全管理生产监督监管信息系统APP终端</view>
		<view>选题时间：2022年12月13日</view>
		<view>构思时间：2022年3月5日</view>
		<view>编码时间：2023年4月1日</view>
		<view>论文时间：2023年5月8日</view>
		<u-line margin="5px"></u-line>
		<view>
			因为大四是工作实习的时间，这些时间就非常的忙了，前前后后从选题、文献分析、需求分析、系统设计、系统编码、测试、部署、论文撰写，其实并没有一个很好的时间节奏，每每准备开始着手总有数不尽的事情打断，每次碎片时间想想论文的工作量应该不会花多少时间，所以时间就不知不觉的往后延期了，四月份请了个长假，然后主要精力来完成毕业设计。
		</view>
		<u-line margin="5px"></u-line>
		<view>
			说说选题分析：分析选题的时候，因为就一个题目而言来说，我的方向就产生了很多种，交通安全管理生产监督监管信息系统APP终端，拆解出来就是，交通安全，管理，生产监督，app，针对这些关键字的文献阅读了很多，大致方向几种：大数据平台、高细度业务流、信息管理平台、GIS系统；因为题目立意于交通和安全为核心，这种主题一想想就需要很多相关数据，而这些数据对于我的本科论文来讲，并不是很好获取，所以交通大数据平台不行。
		</view>
		<u-line margin="5px"></u-line>
		<view>
			信息管理平台一样需要知晓很多相关业务和大量相关信息数据，而这点需求我可能很不好拿捏准确度，而且这种方向对与安卓来讲十分不友好，在分析分析高细度业务，一样不是我的专长，我可能没有这个精力去了解；等等等等，GIS系统在很多篇论文都提到的名词，GIS甚至是一个大学专业，虽然是我从没有了解过的方向，但是在阅读了很多文献和着眼于app小体量的设计后，我觉得GIS系统在我的选题上是非常适合的，以更容易的地图信息来作为数据，与地图交互，传递处理信息，作为GIS的核心，我觉得可行性最高，而且地图相关业务我之前也没有开发过，我还是非常的期待的，所以选题的角度敲定核心是GIS系统，注册高德开发者，使用高德的地图API。这是我选题定下的最初的方向。
		</view>
		<u-line margin="5px"></u-line>
		<view>
			说说需求分析：知道需要在自己的app构建GIS系统，然后实现相关地图操作，那主题业务选什么，从一些文献中看到很多已经在实施的方案，是地图标记和区域划分来创建传递信息，以此开展业务，所以在查阅分析相关文献后，定位为交警执勤，为什么呢？首先选题够小，业务够具体，核心的业务医生或经验来说我也能自己设计，而且数据获取没有难度，都是业务数据，不需要什么核心数据，诸如此，执勤无忧，是我的app实施方向。
		</view>
		<u-line margin="5px"></u-line>
		<view>
			说说编码：安卓技术栈是个人盲区，分析了技术栈方向，一是java写的原生app，一是目前流行的uniapp多平台app，前者app来说更稳定，而后者似乎是市场流行的快速开发app的最佳解决方案，因为java技术栈熟悉，因此最初还是决定使用原生开发，但是开发了几天后，发现不是很有经验的我来说，这种前端操作还是非常费事的，一段评估，最终还是转了uniapp，使用vue构建前端，java做后端，这套技术栈是我最熟的，所以uniapp的开发我还是转了。
		</view>
		<u-line margin="5px"></u-line>
		<view>
			因为就是后端开发的技术栈，所以后端开发就不费什么力气，但是app开发里的大部分精力其实还是前端工作，对我来说应该是最烧脑的一段编码时间了，别人的模板看着不顺眼，自己写很多理解又不够，时间比较匆忙的情况，这些前端写的还是比较的痛苦的，估摸着时间，适当调整了一些需求和写法，用这套技术栈还是写完了。
		</view>
		<u-line margin="5px"></u-line>
		<view>说说整个过程：app开发算是具备个人开发的能力了，uniapp终究还是太不稳定，使用起来也是不怎么顺手，应该是不怎么想用了，使用起来感觉笨笨的，不知道是不是我不会用。</view>
		<u-line margin="5px"></u-line>
		<view>
			最后：毕业论文的时间线说拉的很长，但是工作的时间也过的很快，不知不觉的就到了毕业的时间，而完成毕业设计和论文的时间也是非常的急促，因为过程中个人还有其他项目需要维护，精力就不是很多，但是我还是挺欣喜于选择计算机专业，从事计算机行业，这些进度就像打怪升级，自己不断成长，不断进度，不断更新，如今已从互联网时代开始过渡到人工智能时代，作为一名计算机行业的萌新从业者，有更多的选择，更多的机遇，更美好的遇见，我当然会不断学习进步，热爱我所热爱。
		</view>
		<u-line margin="5px"></u-line>
	</view>
</template>

<script>
</script>

<style>
</style>